---
kind: type
id: T:Autodesk.Revit.DB.FilterOperatorAndTextString
source: html/90d2062e-8e6e-a69e-68de-bef31a7810c2.htm
---
# Autodesk.Revit.DB.FilterOperatorAndTextString

An instance of this class holds a filter operator and a text string that denotes
 the operator in a particular context. For example, the text string for ScheduleFilterType::LessThan
 may be "is less than" for a filter rule based on a parameter with numerical values
 or "is below" for a filter rule based on a parameter representing a Level.

## Syntax (C#)
```csharp
public class FilterOperatorAndTextString : IDisposable
```